       IDENTIFICATION DIVISION.
       PROGRAM-ID.  HELLO.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-GREETING PIC X(14) VALUE SPACES.
       PROCEDURE DIVISION.

       1000-HELLO.
            MOVE 'Goodbye, Mars!' TO WS-GREETING
           .    
